## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,544 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
+ <= read (data resources)
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.flexible-mysql.data.azurerm_client_config.current will be read during apply
+  # (depends on a resource or a module with changes pending)
+ <= data "azurerm_client_config" "current" {
+      + client_id       = (known after apply)
+      + id              = (known after apply)
+      + object_id       = (known after apply)
+      + subscription_id = (known after apply)
+      + tenant_id       = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_key_vault_key.geo_cmk_key[0] will be created
+  + resource "azurerm_key_vault_key" "geo_cmk_key" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + expiration_date         = "2034-05-22T18:29:59Z"
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "encrypt",
+          + "decrypt",
+          + "sign",
+          + "verify",
+          + "wrapKey",
+          + "unwrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "geo-cmk-key-core-dev-inci"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_key_vault_key.primary_cmk_key[0] will be created
+  + resource "azurerm_key_vault_key" "primary_cmk_key" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + expiration_date         = "2034-05-22T18:29:59Z"
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "encrypt",
+          + "decrypt",
+          + "sign",
+          + "verify",
+          + "wrapKey",
+          + "unwrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "s-cmk-key-core-dev-inci"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_monitor_diagnostic_setting.mysql[0] will be created
+  + resource "azurerm_monitor_diagnostic_setting" "mysql" {
+      + id                             = (known after apply)
+      + log_analytics_destination_type = "AzureDiagnostics"
+      + log_analytics_workspace_id     = (known after apply)
+      + name                           = "mysql-diagnostic-log-core-dev-inci"
+      + target_resource_id             = (known after apply)
+
+      + enabled_log {
+          + category       = "MySqlAuditLogs"
+            # (1 unchanged attribute hidden)
+        }
+
+      + enabled_metric (known after apply)
+
+      + metric {
+          + category = "AllMetrics"
+          + enabled  = true
+        }
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_database.main[0] will be created
+  + resource "azurerm_mysql_flexible_database" "main" {
+      + charset             = "utf8mb3"
+      + collation           = "utf8mb3_unicode_ci"
+      + id                  = (known after apply)
+      + name                = "maindb"
+      + resource_group_name = "rg-core-dev-inci"
+      + server_name         = "pgsql-fs-core-dev-inci"
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_server.main[0] will be created
+  + resource "azurerm_mysql_flexible_server" "main" {
+      + administrator_login           = "mysqlusername"
+      + administrator_password        = (sensitive value)
+      + administrator_password_wo     = (write-only attribute)
+      + backup_retention_days         = 7
+      + create_mode                   = "Default"
+      + delegated_subnet_id           = (known after apply)
+      + fqdn                          = (known after apply)
+      + geo_redundant_backup_enabled  = true
+      + id                            = (known after apply)
+      + location                      = "centralindia"
+      + name                          = "pgsql-fs-core-dev-inci"
+      + private_dns_zone_id           = (known after apply)
+      + public_network_access         = (known after apply)
+      + public_network_access_enabled = (known after apply)
+      + replica_capacity              = (known after apply)
+      + replication_role              = (known after apply)
+      + resource_group_name           = "rg-core-dev-inci"
+      + sku_name                      = "GP_Standard_D8ds_v4"
+      + version                       = "8.0.21"
+      + zone                          = "1"
+
+      + customer_managed_key {
+          + geo_backup_key_vault_key_id          = (known after apply)
+          + geo_backup_user_assigned_identity_id = (known after apply)
+          + key_vault_key_id                     = (known after apply)
+          + primary_user_assigned_identity_id    = (known after apply)
+        }
+
+      + identity {
+          + identity_ids = (known after apply)
+          + type         = "UserAssigned"
+        }
+
+      + storage {
+          + auto_grow_enabled   = true
+          + io_scaling_enabled  = false
+          + iops                = 360
+          + log_on_disk_enabled = false
+          + size_gb             = 20
+        }
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_server_configuration.main[0] will be created
+  + resource "azurerm_mysql_flexible_server_configuration" "main" {
+      + id                  = (known after apply)
+      + name                = "interactive_timeout"
+      + resource_group_name = "rg-core-dev-inci"
+      + server_name         = "pgsql-fs-core-dev-inci"
+      + value               = "600"
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_server_configuration.main[1] will be created
+  + resource "azurerm_mysql_flexible_server_configuration" "main" {
+      + id                  = (known after apply)
+      + name                = "audit_log_enabled"
+      + resource_group_name = "rg-core-dev-inci"
+      + server_name         = "pgsql-fs-core-dev-inci"
+      + value               = "ON"
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_server_configuration.main[2] will be created
+  + resource "azurerm_mysql_flexible_server_configuration" "main" {
+      + id                  = (known after apply)
+      + name                = "audit_log_events"
+      + resource_group_name = "rg-core-dev-inci"
+      + server_name         = "pgsql-fs-core-dev-inci"
+      + value               = "CONNECTION,ADMIN,DDL,TABLE_ACCESS"
+    }
+
+  # module.flexible-mysql.azurerm_role_assignment.geo_cmk_role_assignment[0] will be created
+  + resource "azurerm_role_assignment" "geo_cmk_role_assignment" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_role_assignment.primary_cmk_role_assignment[0] will be created
+  + resource "azurerm_role_assignment" "primary_cmk_role_assignment" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_user_assigned_identity.geo_cmk_umi[0] will be created
+  + resource "azurerm_user_assigned_identity" "geo_cmk_umi" {
+      + client_id           = (known after apply)
+      + id                  = (known after apply)
+      + location            = "centralindia"
+      + name                = "core-dev-inci-cmk-geo-identity"
+      + principal_id        = (known after apply)
+      + resource_group_name = "rg-core-dev-inci"
+      + tenant_id           = (known after apply)
+    }
+
+  # m
```
See the full diff from https://github.com/terraform-az-modules/terraform-azurerm-flexible-mysql/actions/runs/19340333739

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azurerm-flexible-mysql/actions/runs/19340333739)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->